namespace ClientMonitoring.Web.Domain.SahredKernel
{
    public static class WilayaGroups
    {
        public static readonly Dictionary<int, (string Title, string[] Wilayas)> Groups = new()
        {
            [1] = ("إسماعيل بوقرة", 
            new[] { "12", "13", "14", "25", "32", "41", "60", "62", "65" }),
            
            [2] = ("الحاج خديمي", 
            new[] { "01", "06", "09", "19", "22", "28", "38", "44", "63" }),
            
            [3] = ("عبد المجيد بليليطة", 
            new[] { "02", "04", "16", "20", "21", "35", "36", "43" }),
            
            [4] = ("علي بن زادي", 
            new[] { "08", "10", "18", "23", "29", "34", "48", "52", "59" }),
            
            [5] = ("كمال زيان لعرابة", 
            new[] { "27", "37", "40", "42", "46", "69" }),
            

            [6] = ("مسعود عدالة", 
            new[] { "05", "11", "17", "31", "33", "50", "54", "68" }),
            
            [7] = ("موسى اعمارة", 
            new[] { "03", "15", "24", "26", "45", "61", "64", "66", "67" }),
            
            [8] = ("نوفل حدانة", 
            new[] { "07", "30", "39", "47", "49", "51", "53", "55", "56", "57", "58" })
            
        };
    }
}
